ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
/***************************************************************************//**
* \file cy_ble_ess.c
* \version 2.0
*
* \brief
*  Contains the source code for the Environmental Sensing Service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_ESS))

#ifdef CY_BLE_ESS_SERVER
/* The internal storage for the last request handle to check response for server */
static cy_ble_gatt_db_attr_handle_t cy_ble_esssReqHandle;
#endif /* CY_BLE_ESS_SERVER */

#ifdef CY_BLE_ESS_CLIENT
/* The internal storage for the last request handle to check response */
static cy_ble_gatt_db_attr_handle_t cy_ble_esscReqHandle[CY_BLE_CONFIG_GATTC_COUNT];

/* Read Long Descriptors variables */
static uint8_t * cy_ble_esscRdLongBuffPtr[CY_BLE_CONFIG_GATTC_COUNT] = { NULL };
static uint32_t cy_ble_esscRdLongBuffLen[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };
static uint8_t cy_ble_esscCurrLen[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };

uint8_t activeCharIndex[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };
uint8_t activeCharInstance[CY_BLE_CONFIG_GATTC_COUNT] = { 0u };
uint8_t prevCharInstIndex[CY_BLE_CONFIG_GATTC_COUNT];

#endif /* (CY_BLE_ESS_CLIENT) */

static cy_ble_callback_t Cy_BLE_ESS_ApplCallback = NULL;

/* The pointer on global BLE ESS Config structure */
cy_stc_ble_ess_config_t *cy_ble_essConfigPtr = NULL;

/***************************************
* Private Function Prototypes
***************************************/
#ifdef CY_BLE_ESS_SERVER
static cy_en_ble_gatt_err_code_t Cy_BLE_ESSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
static void Cy_BLE_ESSS_PrepareWriteRequestEventHandler(const cy_stc_ble_gatts_prep_write_req_param_t *eventParam);
static void Cy_BLE_ESSS_ExecuteWriteRequestEventHandler(cy_stc_ble_gatts_exec_write_req_t *eventParam);
static void Cy_BLE_ESSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
#endif /* CY_BLE_ESS_SERVER */

#ifdef CY_BLE_ESS_CLIENT
static void Cy_BLE_ESSC_DiscoverCharacteristicsEventHandler(const cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_ESSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_ESSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_ESSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam);
static void Cy_BLE_ESSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam);
static void Cy_BLE_ESSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_ESSC_ReadLongRespEventHandler(const cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_ESSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_ESSC_ExecuteWriteResponseEventHandler(const cy_stc_ble_gattc_exec_write_rsp_t *eventParam);
static void Cy_BLE_ESSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
#endif /* CY_BLE_ESS_CLIENT */
static cy_en_ble_gatt_err_code_t Cy_BLE_ESS_EventHandler(uint32_t eventCode, void *eventParam);


/******************************************************************************
* Function Name: Cy_BLE_ESS_Init
***************************************************************************//**
*
*  This function initializes the Environmental Sensing Service.
*
*  \param config: Configuration structure for the Environmental Sensing Service.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER          | On specifying NULL as input parameter
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED   | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_ESS_Init(cy_stc_ble_ess_config_t *config)
{
    cy_en_ble_api_result_t apiResult;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Registers a pointer to config structure*/
        cy_ble_essConfigPtr = config;

        /* Registers Event Handler for the ESS Service */
        apiResult = Cy_BLE_RegisterServiceEventHandler(&Cy_BLE_ESS_EventHandler);

        /* Registers a callback function via config structure */
        if(cy_ble_essConfigPtr->callbackFunc != NULL)
        {
            Cy_BLE_ESS_ApplCallback = cy_ble_essConfigPtr->callbackFunc;
        }

    #ifdef CY_BLE_ESS_SERVER
        cy_ble_esssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
    #endif /* CY_BLE_ESS_SERVER */

    #ifdef CY_BLE_ESS_CLIENT
        {
            uint32_t idx;
            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                uint32_t i;
                uint32_t j;

                if(cy_ble_serverInfo[idx][CY_BLE_SRVI_ESS].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                {
                    for(i = (uint32_t)CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED; (i < ((uint32_t)CY_BLE_ESS_CHAR_COUNT)); i++)
                    {
                        for(j = 0u; j < cy_ble_essConfigPtr->esscCharInstances[i]; j++)
                        {
                            (void)memset(&cy_ble_essConfigPtr->essc[idx].charInfoAddr[i].charInfoPtr[j], 0,
                                         sizeof(cy_stc_ble_essc_char_t));
                        }
                    }

                    /* initialize uuid  */
                    cy_ble_serverInfo[idx][CY_BLE_SRVI_ESS].uuid = CY_BLE_UUID_ENVIRONMENTAL_SENSING_SERVICE;
                }
                cy_ble_esscRdLongBuffPtr[idx] = NULL;
                cy_ble_esscRdLongBuffLen[idx] = 0u;
                cy_ble_esscCurrLen[idx] = 0u;
                activeCharIndex[idx] = 0u;
                activeCharInstance[idx] = 0u;
                prevCharInstIndex[idx] = 0u;
                cy_ble_esscReqHandle[idx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
        }
    #endif /* CY_BLE_ESS_CLIENT */
    }

    return(apiResult);
}


