ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
/******************************************************************************
* Function Name: Cy_BLE_ESS_RegisterAttrCallback
***************************************************************************//**
*
*  Registers a callback function for service-specific attribute operations.
*  Service specific write requests from peer device will not be handled with
*  unregistered callback function.
*
*  \param callbackFunc:  An application layer event callback function to receive
*                 events from the BLE Component. The definition of
*                 cy_ble_callback_t for ESS Service is:\n
*                 typedef void (* cy_ble_callback_t) (uint32_t eventCode,
*                                                    void *eventParam)
*                 * eventCode:  Indicates the event that triggered this callback
*                   (e.g. CY_BLE_EVT_ESSS_NOTIFICATION_ENABLED).
*                 * eventParam: Contains the parameters corresponding to the
*                   current event. (e.g. Pointer to cy_stc_ble_ess_char_value_t
*                   structure that contains details of the characteristic
*                   for which the notification enabled event was triggered).
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes:
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_OPERATION          | This operation is not permitted
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_ESS_RegisterAttrCallback(cy_ble_callback_t callbackFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    
    Cy_BLE_ESS_ApplCallback = callbackFunc;
    if(cy_ble_essConfigPtr != NULL)
    {
        cy_ble_essConfigPtr->callbackFunc = callbackFunc;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    
    return(apiResult);
}


#ifdef CY_BLE_ESS_SERVER

/******************************************************************************
* Function Name: Cy_BLE_ESS_Get24ByPtr
***************************************************************************//**
*
*  Returns a three-bytes value by using a pointer to the LSB. The value is
*  returned as uint32_t.
*
*  \param ptr: The pointer to the LSB of three-byte data (little-endian).
*
* \return
*  uint32_t value: Three-byte data.
*
******************************************************************************/
uint32_t Cy_BLE_ESS_Get24ByPtr(const uint8_t ptr[])
{
    return(((uint32_t)ptr[0u]) | ((uint32_t)(((uint32_t)ptr[1u]) << 8u)) | ((uint32_t)((uint32_t)ptr[2u]) << 16u));
}


/******************************************************************************
* Function Name: Cy_BLE_ESS_Get32ByPtr
***************************************************************************//**
*
*  Returns a four-byte value by using a pointer to the LSB.
*
*  \param ptr: The pointer to the LSB of four-byte data (little-endian).
*
* \return
*  uint32_t value: Four-byte data.
*
******************************************************************************/
uint32_t Cy_BLE_ESS_Get32ByPtr(const uint8_t ptr[])
{
    return(((uint32_t)ptr[0u]) | ((uint32_t)(((uint32_t)ptr[1u]) << 8u)) | ((uint32_t)((uint32_t)ptr[2u]) << 16u) |
           ((uint32_t)((uint32_t)ptr[3u]) << 24u));
}


/******************************************************************************
* Function Name: Cy_BLE_ESSS_CheckIfInRange
***************************************************************************//**
*
*  Checks if the "value" is in the range of "min" and "max". As the ESS
*  characteristics operate with signed or unsigned value types and the value in
*  the GATT database are stored in unsigned variables. Need to clearly identify
*  the signedness of each "value", "min" and "max". After that the values can
*  be properly compared. The signedness of each parameter is encoded in "state"
*  and has the following meaning:
*     State 0: All three are positive (all three are of unsigned type)
*     State 1: Min - positive, Max - positive, Value - negative
*     State 2: Min - positive, Max - negative, Value - positive
*     State 3: Min - positive, Max - negative, Value - negative
*     State 4: Min - negative, Max - positive, Value - positive
*     State 5: Min - negative, Max - positive, Value - negative
*     State 6: Min - negative, Max - negative, Value - positive
*     State 7: All three are negative
*
*  min - Minimum inclusive limit.
*  max - Minimum inclusive limit.
*  value - The value to be checked if it is in the range.
*  state - The state as shown above.
*
* \return
*  A return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - "value" is in the range.
*   * CY_BLE_GATT_ERR_OUT_OF_RANGE - "value" is not in the range.
*
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_ESSS_CheckIfInRange(uint32_t min,
                                                     uint32_t max,
                                                     uint32_t value,
                                                     uint8_t state)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;

    switch(state)
    {
        /* All values are positive */
        case CY_BLE_ESS_STATE_0:
            if((min > value) || (max < value))
            {
                gattErr = CY_BLE_GATT_ERR_OUT_OF_RANGE;
            }
            break;

        /* "Not in range" cases. Min and Max are negative and value is positive or
         * vice versa.
         */
        case CY_BLE_ESS_STATE_1:
        case CY_BLE_ESS_STATE_6:
            gattErr = CY_BLE_GATT_ERR_OUT_OF_RANGE;
            break;

        /* Min is negative, Max and value are positive */
        case CY_BLE_ESS_STATE_4:
            if(max < value)
            {
                gattErr = CY_BLE_GATT_ERR_OUT_OF_RANGE;
            }
            break;

        /* Max is positive, Min and value are negative */
        case CY_BLE_ESS_STATE_5:
            if(min > value)
            {
                gattErr = CY_BLE_GATT_ERR_OUT_OF_RANGE;
            }
            break;

        /* All values are negative */
        case CY_BLE_ESS_STATE_7:
            if((min > value) || (max < value))
            {
                gattErr = CY_BLE_GATT_ERR_OUT_OF_RANGE;
            }
            break;

