ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
        /* Invalid cases. Handled by customizer. */
        case CY_BLE_ESS_STATE_2:
        case CY_BLE_ESS_STATE_3:
        default:
            gattErr = CY_BLE_GATT_ERR_OUT_OF_RANGE;
            break;
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: Cy_BLE_ESS_HandleRangeCheck
***************************************************************************//**
*
*  Performs an extraction of the characteristic value ranges then compares it to
*  the value received from the client and returns a result of the comparison.
*
*  \param charIndex: The index of the service characteristic. Starts with zero.
*  \param charInstance: The instance number of the characteristic specified by
*                "charIndex".
*  \param length: The length of a buffer to store the main and may ranges. Can be 2,4,6
*          or 8 bytes.
*  \param type: Identifies the type of the value pointed by "pValue" (0 - the value
*        is of unsigned type, 1 - the value is of signed type).
*  \param pValue: The pointer to the value to be validated if it is in the range.
*
*
* \return
*  A return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - The value stored in "pValue" is in ranges specified
*                           by Valid Range Descriptor of the characteristic
*                           addressed by "charIndex" and "charInstance".
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - Failed to read Valid Range Descriptor
*                                     value.
*   * CY_BLE_GATT_ERR_OUT_OF_RANGE - The value stored in "pValue" is not in the
*                                   valid ranges.
*
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_ESS_HandleRangeCheck(cy_stc_ble_conn_handle_t connHandle,
                                                      cy_en_ble_ess_char_index_t charIndex,
                                                      uint8_t charInstance,
                                                      uint16_t length,
                                                      uint8_t type,
                                                      const uint8_t pValue[])
{
    uint8_t locState = 0u;
    uint8_t skipSignCheck = 0u;
    uint8_t tmpBuff[8u];
    uint32_t maxLimit = 0u;
    uint32_t minLimit = 0u;
    uint32_t operand = 0u;
    uint32_t u32Sign = 0u;
    cy_en_ble_gatt_err_code_t apiResult = CY_BLE_GATT_ERR_UNLIKELY_ERROR;

    if(Cy_BLE_ESSS_GetCharacteristicDescriptor(connHandle, charIndex, charInstance, CY_BLE_ESS_VRD, length, tmpBuff) ==
       CY_BLE_SUCCESS)
    {
        switch(length)
        {
            case CY_BLE_ESS_2BYTES_LENGTH:
                operand = (uint32_t)(pValue[0u]);
                minLimit = (uint32_t)(tmpBuff[0u]);
                maxLimit = (uint32_t)(tmpBuff[1u]);
                u32Sign = CY_BLE_ESS_U8_SIGN_BIT;
                break;

            case CY_BLE_ESS_4BYTES_LENGTH:
                operand = (uint32_t)Cy_BLE_ESS_Get16ByPtr(&pValue[0u]);
                minLimit = (uint32_t)Cy_BLE_ESS_Get16ByPtr(&tmpBuff[0u]);
                maxLimit = (uint32_t)Cy_BLE_ESS_Get16ByPtr(&tmpBuff[2u]);
                u32Sign = CY_BLE_ESS_U16_SIGN_BIT;
                break;

            case CY_BLE_ESS_6BYTES_LENGTH:
                operand = (uint32_t)Cy_BLE_ESS_Get24ByPtr(&pValue[0u]);
                minLimit = (uint32_t)Cy_BLE_ESS_Get24ByPtr(&tmpBuff[0u]);
                maxLimit = (uint32_t)Cy_BLE_ESS_Get24ByPtr(&tmpBuff[3u]);
                u32Sign = CY_BLE_ESS_U24_SIGN_BIT;
                break;

            case CY_BLE_ESS_8BYTES_LENGTH:
                operand = (uint32_t)Cy_BLE_ESS_Get32ByPtr(&pValue[0u]);
                minLimit = (uint32_t)Cy_BLE_ESS_Get32ByPtr(&tmpBuff[0u]);
                maxLimit = (uint32_t)Cy_BLE_ESS_Get32ByPtr(&tmpBuff[4u]);
                break;

            default:
                skipSignCheck = 1u;
                break;
        }

        if(skipSignCheck == 0u)
        {
            if(type != CY_BLE_ESS_UNSIGNED_TYPE)
            {
                locState = CY_BLE_ESS_IS_NEGATIVE(minLimit, u32Sign) << 1u;
                locState = (locState | CY_BLE_ESS_IS_NEGATIVE(maxLimit, u32Sign)) << 1u;
                locState |= CY_BLE_ESS_IS_NEGATIVE(operand, u32Sign);
            }
            else
            {
                locState = 0u;
            }
        }

        /* Compare the operand to the limits with respect to the state
         * and return the results.
         */
        apiResult = Cy_BLE_ESSS_CheckIfInRange(minLimit, maxLimit, operand, locState);
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_ESSS_WriteEventHandler
***************************************************************************//**
*
*  Handles a Write Request event for Environmental Sensing Service.
*
*  \param eventParam: The pointer to the data structure specified by an event.
*
* \return
*  A return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - Write is successful.
*   * CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED - Request is not supported.
*   * CY_BLE_GATT_ERR_INVALID_HANDLE - 'handleValuePair.attrHandle' is not valid.
*   * CY_BLE_GATT_ERR_WRITE_NOT_PERMITTED - Write operation is not permitted on
*                                          this attribute.
*   * CY_BLE_GATT_ERR_INVALID_OFFSET - the offset value is invalid.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - Some other error occurred.
*   * CY_BLE_GATT_ERR_CONDITION_NOT_SUPPORTED - The condition in ES Trigger Settings
*                                              Descriptor is not supported.
*   * CY_BLE_GATT_ERR_WRITE_REQ_REJECTED - A write request was rejected.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_ESSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    uint32_t event = (uint32_t)CY_BLE_EVT_ESSS_DESCR_WRITE;
    uint32_t foundItem = 0u;
    uint8_t i;
    uint8_t j;
    cy_stc_ble_esss_char_t *essCharInfoPtr;
    cy_stc_ble_ess_descr_value_t wrDescrReqParam = { .connHandle = eventParam->connHandle };
    cy_ble_gatt_db_attr_handle_t tmpHandle;
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;

