ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
    tmpHandle = eventParam->handleValPair.attrHandle;

    if(Cy_BLE_ESS_ApplCallback != NULL)
    {
        wrDescrReqParam.descrIndex = CY_BLE_ESS_DESCR_COUNT;

        /* Go through all possible Service characteristics.
         * Exit the handler in following conditions:
         * 1) No more characteristic left;
         * 2) Characteristic or descriptor was successfully written;
         * 3) Error occurred while writing characteristic or descriptor.
         */
        for(i = 0u; ((i < (uint8_t)CY_BLE_ESS_CHAR_COUNT) && (foundItem == 0u) && (gattErr == CY_BLE_GATT_ERR_NONE)); i++)
        {
            /* Check if characteristic is enabled. If the pointer to the characteristic
             * is not "NULL", there is at least one instance of the characteristic in
             * the ES Service.
             */
            if(cy_ble_essConfigPtr->esss->charInfoAddr[i].charInfoPtr != NULL)
            {
                for(j = 0u; j < cy_ble_essConfigPtr->esssCharInstances[i]; j++)
                {
                    essCharInfoPtr = &cy_ble_essConfigPtr->esss->charInfoAddr[i].charInfoPtr[j];

                    /* Client Characteristic Configuration Descriptor Write Request handling */
                    if(tmpHandle == essCharInfoPtr->descrHandle[CY_BLE_ESS_CCCD])
                    {
                        /* Verify that optional notification property is enabled for characteristic */
                        if(CY_BLE_IS_NOTIFICATION_SUPPORTED(essCharInfoPtr->charHandle))
                        {
                            if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                            {
                                event = (uint32_t)CY_BLE_EVT_ESSS_NOTIFICATION_ENABLED;
                            }
                            else
                            {
                                event = (uint32_t)CY_BLE_EVT_ESSS_NOTIFICATION_DISABLED;
                            }

                            /* Value is NULL for descriptors */
                            wrDescrReqParam.value = NULL;
                            wrDescrReqParam.descrIndex = CY_BLE_ESS_CCCD;
                            foundItem = CY_BLE_ESS_DESCRIPTOR_ITEM;

                        #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                            (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
                            /* Set flag to store bonding data to flash */
                            if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                            {
                                cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                            }
                        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
                        }
                        else if(CY_BLE_IS_INDICATION_SUPPORTED(essCharInfoPtr->charHandle))
                        {
                            if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                            {
                                event = (uint32_t)CY_BLE_EVT_ESSS_INDICATION_ENABLED;
                            }
                            else
                            {
                                event = (uint32_t)CY_BLE_EVT_ESSS_INDICATION_DISABLED;
                            }

                            /* Value is NULL for descriptors */
                            wrDescrReqParam.value = NULL;
                            wrDescrReqParam.descrIndex = CY_BLE_ESS_CCCD;
                            foundItem = CY_BLE_ESS_DESCRIPTOR_ITEM;

                        #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                            (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
                            /* Set flag to store bonding data to flash */
                            if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                            {
                                cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                            }
                        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
                        }
                        else
                        {
                            gattErr = (cy_en_ble_gatt_err_code_t)CY_BLE_GATT_ERR_WRITE_REQ_REJECTED;
                        }
                    }
                    else if(tmpHandle == essCharInfoPtr->descrHandle[CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR1])
                    {
                        wrDescrReqParam.descrIndex = CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR1;
                        foundItem = CY_BLE_ESS_DESCRIPTOR_ITEM;
                    }
                    else if(tmpHandle == essCharInfoPtr->descrHandle[CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR2])
                    {
                        wrDescrReqParam.descrIndex = CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR2;
                        foundItem = CY_BLE_ESS_DESCRIPTOR_ITEM;
                    }
                    else if(tmpHandle == essCharInfoPtr->descrHandle[CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR3])
                    {
                        wrDescrReqParam.descrIndex = CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR3;
                        foundItem = CY_BLE_ESS_DESCRIPTOR_ITEM;
                    }
                    else if(tmpHandle == essCharInfoPtr->descrHandle[CY_BLE_ESS_ES_CONFIG_DESCR])
                    {
                        wrDescrReqParam.descrIndex = CY_BLE_ESS_ES_CONFIG_DESCR;
                        foundItem = CY_BLE_ESS_DESCRIPTOR_ITEM;
                    }
                    else if(tmpHandle == essCharInfoPtr->descrHandle[CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR])
                    {
                        wrDescrReqParam.descrIndex = CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR;
                        foundItem = CY_BLE_ESS_DESCRIPTOR_ITEM;
                    }
                    else
                    {
                        /* No handle match was found */
                    }

                    /* Verify if requested handle was found and successfully handled */
                    if((gattErr == CY_BLE_GATT_ERR_NONE) && (0u != foundItem))
                    {
                        switch(wrDescrReqParam.descrIndex)
                        {
                            case CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR1:
                            case CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR2:
                            case CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR3:
                                if(eventParam->handleValPair.value.val[0u] > CY_BLE_ESS_TRIG_WHILE_EQUAL_NOT_TO)
                                {
                                    /* Trigger condition is not supported */
                                    gattErr = (cy_en_ble_gatt_err_code_t)CY_BLE_GATT_ERR_CONDITION_NOT_SUPPORTED;
                                }
                                /* If Valid Range Descriptor for the characteristic is present, then
                                 * check the characteristic value range. The ranges should be properly
                                 * set in the server or otherwise the server will constantly return an
                                 * "Out of range" error.
                                 */
                                else if((CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE !=
                                         essCharInfoPtr->descrHandle[CY_BLE_ESS_VRD]) &&
                                        (eventParam->handleValPair.value.len > 1u) &&
                                        (eventParam->handleValPair.value.val[0u] >= CY_BLE_ESS_TRIG_WHILE_LESS_THAN))
                                {
                                    /* The following "switch" groups characteristics are based on their value
                                     * type.
                                     */
                                    switch((cy_en_ble_ess_char_index_t)i)
                                    {
                                        /* uint8_t */
                                        case CY_BLE_ESS_BAROMETRIC_PRESSURE_TREND:
                                        case CY_BLE_ESS_GUST_FACTOR:
                                        case CY_BLE_ESS_UV_INDEX:
                                            gattErr = Cy_BLE_ESS_HandleRangeCheck(eventParam->connHandle,
                                                                                  (cy_en_ble_ess_char_index_t)i, j,
                                                                                  CY_BLE_ESS_2BYTES_LENGTH,
                                                                                  CY_BLE_ESS_UNSIGNED_TYPE,
                                                                                  &eventParam->handleValPair.value.val[1u]);
                                            break;

                                        /* uint16_t */
                                        case CY_BLE_ESS_APPARENT_WIND_DIR:
                                        case CY_BLE_ESS_APPARENT_WIND_SPEED:
                                        case CY_BLE_ESS_HUMIDITY:
                                        case CY_BLE_ESS_IRRADIANCE:
                                        case CY_BLE_ESS_MAGNETIC_DECLINATION:
                                        case CY_BLE_ESS_RAINFALL:
                                        case CY_BLE_ESS_TRUE_WIND_DIR:
                                        case CY_BLE_ESS_TRUE_WIND_SPEED:
                                            gattErr = Cy_BLE_ESS_HandleRangeCheck(eventParam->connHandle,
                                                                                  (cy_en_ble_ess_char_index_t)i, j,
                                                                                  CY_BLE_ESS_4BYTES_LENGTH,
                                                                                  CY_BLE_ESS_UNSIGNED_TYPE,
                                                                                  &eventParam->handleValPair.value.val[1u]);
                                            break;

                                        /* uint24 */
                                        case CY_BLE_ESS_POLLEN_CONCENTRATION:
                                            gattErr = Cy_BLE_ESS_HandleRangeCheck(eventParam->connHandle,
                                                                                  (cy_en_ble_ess_char_index_t)i, j,
                                                                                  CY_BLE_ESS_6BYTES_LENGTH,
                                                                                  CY_BLE_ESS_UNSIGNED_TYPE,
                                                                                  &eventParam->handleValPair.value.val[1u]);
                                            break;

