ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
                                        /* uint32_t */
                                        case CY_BLE_ESS_PRESSURE:
                                            gattErr = Cy_BLE_ESS_HandleRangeCheck(eventParam->connHandle,
                                                                                  (cy_en_ble_ess_char_index_t)i, j,
                                                                                  CY_BLE_ESS_8BYTES_LENGTH,
                                                                                  CY_BLE_ESS_UNSIGNED_TYPE,
                                                                                  &eventParam->handleValPair.value.val[1u]);
                                            break;

                                        /* int8_t */
                                        case CY_BLE_ESS_DEW_POINT:
                                        case CY_BLE_ESS_HEAT_INDEX:
                                        case CY_BLE_ESS_WIND_CHILL:
                                            gattErr = Cy_BLE_ESS_HandleRangeCheck(eventParam->connHandle,
                                                                                  (cy_en_ble_ess_char_index_t)i, j,
                                                                                  CY_BLE_ESS_2BYTES_LENGTH,
                                                                                  CY_BLE_ESS_SIGNED_TYPE,
                                                                                  &eventParam->handleValPair.value.val[1u]);
                                            break;

                                        /* int16_t */
                                        case CY_BLE_ESS_TEMPERATURE:
                                            gattErr = Cy_BLE_ESS_HandleRangeCheck(eventParam->connHandle,
                                                                                  (cy_en_ble_ess_char_index_t)i, j,
                                                                                  CY_BLE_ESS_4BYTES_LENGTH,
                                                                                  CY_BLE_ESS_SIGNED_TYPE,
                                                                                  &eventParam->handleValPair.value.val[1u]);
                                            break;

                                        /* int24 */
                                        case CY_BLE_ESS_ELEVATION:
                                            gattErr = Cy_BLE_ESS_HandleRangeCheck(eventParam->connHandle,
                                                                                  (cy_en_ble_ess_char_index_t)i, j,
                                                                                  CY_BLE_ESS_6BYTES_LENGTH,
                                                                                  CY_BLE_ESS_SIGNED_TYPE,
                                                                                  &eventParam->handleValPair.value.val[1u]);
                                            break;

                                        case CY_BLE_ESS_MAGNETIC_FLUX_DENSITY_2D:
                                            /* No validation required */
                                            break;

                                        case CY_BLE_ESS_MAGNETIC_FLUX_DENSITY_3D:
                                            /* No validation required */
                                            break;

                                        default:
                                            /* Invalid characteristic */
                                            gattErr = CY_BLE_GATT_ERR_UNLIKELY_ERROR;
                                            break;
                                    }
                                }
                                else /* No error */
                                {
                                    if(CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(
                                           essCharInfoPtr->descrHandle[wrDescrReqParam.descrIndex]) >=
                                       eventParam->handleValPair.value.len)
                                    {
                                        /* Set new length of the descriptor value */
                                        CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(
                                            essCharInfoPtr->descrHandle[wrDescrReqParam.descrIndex],
                                            eventParam->handleValPair.value.len);
                                    }
                                    else
                                    {
                                        gattErr = CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN;
                                    }
                                }
                                break;

                            case CY_BLE_ESS_ES_CONFIG_DESCR:
                                if(eventParam->handleValPair.value.val[0u] > CY_BLE_ESS_CONF_BOOLEAN_OR)
                                {
                                    /* Trigger Logic value is not supported */
                                    gattErr = (cy_en_ble_gatt_err_code_t)CY_BLE_GATT_ERR_WRITE_REQ_REJECTED;
                                }
                                break;

                            case CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR:
                                /* The ESS spec. states are the following: "The Server may also choose to reject
                                 * a write request to the Characteristic User Description if it determines that
                                 * the contents of the new value are unsuitable, such as a string containing
                                 * characters in a language that the implementation does not support."
                                 * This validation is omitted in the current version of the service.
                                 */

                                if(CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(
                                       essCharInfoPtr->descrHandle[CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR]) >=
                                   eventParam->handleValPair.value.len)
                                {
                                    /* Set new length of the descriptor value */
                                    CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(
                                        essCharInfoPtr->descrHandle[CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR],
                                        eventParam->handleValPair.value.len);
                                }
                                else
                                {
                                    gattErr = CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN;
                                }
                                break;

                            default:
                                break;
                        }

