ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
                        /* Check is there no error conditions happen yet */
                        if(gattErr == CY_BLE_GATT_ERR_NONE)
                        {
                            gattErr = Cy_BLE_GATT_DbCheckPermission(eventParam->handleValPair.attrHandle,
                                                                    &eventParam->connHandle, CY_BLE_GATT_DB_WRITE |
                                                                    CY_BLE_GATT_DB_PEER_INITIATED);

                            if(gattErr == CY_BLE_GATT_ERR_NONE)
                            {
                                /* Fill data and pass it to user */
                                wrDescrReqParam.charIndex = (cy_en_ble_ess_char_index_t)i;
                                wrDescrReqParam.charInstance = j;
                                wrDescrReqParam.gattErrorCode = CY_BLE_GATT_ERR_NONE;

                                if(wrDescrReqParam.descrIndex != CY_BLE_ESS_CCCD)
                                {
                                    /* Check if descriptor index is not CCCD index as "event" and
                                     * "wrDescrReqParam.value" parameters for CCCD were handled
                                     * above.
                                     */
                                    wrDescrReqParam.value = &eventParam->handleValPair.value;
                                }
                                Cy_BLE_ESS_ApplCallback(event, &wrDescrReqParam);

                                if(wrDescrReqParam.gattErrorCode == CY_BLE_GATT_ERR_NONE)
                                {
                                    /* Write value to GATT database */
                                    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                                    {
                                        .handleValuePair = eventParam->handleValPair,
                                        .connHandle      = eventParam->connHandle,
                                        .offset          = 0u,
                                        .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                                    };
                                    gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
                                }
                            }
                        }

                        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                        break;
                    }
                }
            }
        }
    }

    if(CY_BLE_GATT_ERR_NONE != gattErr)
    {
        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: Cy_BLE_ESSS_PrepareWriteRequestEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event for the Environmental Sensing Service.
*
*  \param eventParam: The pointer to the data that received with a prepare write
*               request event for the  Environmental Sensing Service.
*
******************************************************************************/
static void Cy_BLE_ESSS_PrepareWriteRequestEventHandler(const cy_stc_ble_gatts_prep_write_req_param_t *eventParam)
{
    uint32_t i;
    uint32_t j;
    uint8_t exitLoop = 0u;
    cy_stc_ble_esss_char_t *essCharInfoPtr;

    if(Cy_BLE_ESS_ApplCallback != NULL)
    {
        for(i = 0u; ((i < ((uint8_t)CY_BLE_ESS_CHAR_COUNT)) && (exitLoop == 0u)); i++)
        {
            /* Check if characteristic is enabled. If the pointer to the characteristic
             * is not "NULL", there is at least one instance of the characteristic in
             * the ES Service.
             */
            if(cy_ble_essConfigPtr->esss->charInfoAddr[i].charInfoPtr != NULL)
            {
                for(j = 0u; ((j < cy_ble_essConfigPtr->esssCharInstances[i]) && (exitLoop == 0u)); j++)
                {
                    essCharInfoPtr = &cy_ble_essConfigPtr->esss->charInfoAddr[i].charInfoPtr[j];

                    /* Need to check following conditions: 1) if requested handle is the handle of
                     * Characteristic User Description Descriptor; 2) and if there is no active
                     * requests; 3) or there is an active request but the requested handle is
                     * different handle. the thord condition means that previous request resulted
                     * with an error so need to hanle that.
                     */
                    if(eventParam->baseAddr[eventParam->currentPrepWriteReqCount - 1u].handleValuePair.attrHandle ==
                       essCharInfoPtr->descrHandle[CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR])
                    {
                        if(cy_ble_esssReqHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                        {
                            /* Send Prepare Write Response which identifies acknowledgment for
                             * long characteristic value write.
                             */
                            cy_ble_esssReqHandle =
                                eventParam->baseAddr[eventParam->currentPrepWriteReqCount - 1u].handleValuePair.attrHandle;
                        }
                        /* Indicate that request was handled */
                        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;

                        /* Set the flag to exit the loop */
                        exitLoop = 1u;
                    }
                }
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ESSS_ExecuteWriteRequestEventHandler
***************************************************************************//**
*
*  Handles the Execute Write Request Event for the Environmental Sensing Service.
*
*  \param eventParam: The pointer to the data that came with a write request for the
*              Environmental Sensing Service.
*
******************************************************************************/
static void Cy_BLE_ESSS_ExecuteWriteRequestEventHandler(cy_stc_ble_gatts_exec_write_req_t *eventParam)
{
    uint8_t i;
    uint8_t j;
    uint8_t locCount;
    uint8_t exitLoop = 0u;
    uint16_t locLength = 0u;
    cy_stc_ble_gatt_value_t locDescrValue;
    cy_stc_ble_ess_descr_value_t wrDescrReqParam = { .connHandle = eventParam->connHandle };

