ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
    if(Cy_BLE_ESS_ApplCallback != NULL)
    {
        for(i = 0u; ((i < ((uint8_t)CY_BLE_ESS_CHAR_COUNT)) && (exitLoop == 0u)); i++)
        {
            /* Check if characteristic is enabled. If the pointer to the characteristic
             * is not "NULL", there is at least one instance of the characteristic in
             * the ES Service.
             */
            if(cy_ble_essConfigPtr->esss->charInfoAddr[i].charInfoPtr != NULL)
            {
                for(j = 0u; ((j < cy_ble_essConfigPtr->esssCharInstances[i]) && (exitLoop == 0u)); j++)
                {
                    if((eventParam->baseAddr[0u].handleValuePair.attrHandle ==
                        cy_ble_essConfigPtr->esss->charInfoAddr[i].charInfoPtr[j].
                         descrHandle[CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR]) &&
                       (cy_ble_esssReqHandle == eventParam->baseAddr[0u].handleValuePair.attrHandle))
                    {
                        /* Check the execWriteFlag before execute or cancel write long operation */
                        if(eventParam->execWriteFlag == CY_BLE_GATT_EXECUTE_WRITE_EXEC_FLAG)
                        {
                            for(locCount = 0u; locCount < eventParam->prepWriteReqCount; locCount++)
                            {
                                locLength += eventParam->baseAddr[locCount].handleValuePair.value.len;
                            }

                            if(CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(cy_ble_esssReqHandle) >= locLength)
                            {
                                locDescrValue = eventParam->baseAddr[0u].handleValuePair.value;
                                /* Fill data and pass it to user */
                                wrDescrReqParam.charIndex = (cy_en_ble_ess_char_index_t)i;
                                wrDescrReqParam.charInstance = j;
                                wrDescrReqParam.gattErrorCode = CY_BLE_GATT_ERR_NONE;
                                wrDescrReqParam.value = &locDescrValue;
                                wrDescrReqParam.value->len = locLength;
                                wrDescrReqParam.descrIndex = CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR;

                                Cy_BLE_ESS_ApplCallback((uint32_t)CY_BLE_EVT_ESSS_DESCR_WRITE, &wrDescrReqParam);

                                if(wrDescrReqParam.gattErrorCode == CY_BLE_GATT_ERR_NONE)
                                {
                                    CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(cy_ble_esssReqHandle, locLength);
                                }
                            }
                            else
                            {
                                wrDescrReqParam.gattErrorCode = CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN;
                            }

                            /* Pass user error code to Stack */
                            eventParam->gattErrorCode = (uint8_t)wrDescrReqParam.gattErrorCode;
                        }

                        /* Set the flag to exit the loop */
                        exitLoop = 1u;

                        /* Indicate that request was handled */
                        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;

                        /* Clear requested handle */
                        cy_ble_esssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                    }
                }
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ESSS_ConfirmationEventHandler
***************************************************************************//**
*
*  Handles a Value Confirmation request event from the BLE stack.
*
*  eventParam - The pointer to a structure of type cy_stc_ble_conn_handle_t.
*
******************************************************************************/
static void Cy_BLE_ESSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    if((Cy_BLE_ESS_ApplCallback != NULL) && (CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE != cy_ble_esssReqHandle))
    {
        /* Only Descriptor Value Change Characteristic has Indication property.
         * Check if the requested handle is the handle of Descriptor Value Change
         * handle.
         */
        if(cy_ble_esssReqHandle ==
           cy_ble_essConfigPtr->esss->charInfoAddr[CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED].charInfoPtr[0u].charHandle)
        {
            /* Fill in event data and inform Application about
             * successfully confirmed indication.
             */
            cy_stc_ble_ess_char_value_t locCharValue =
            {
                .connHandle = *eventParam,
                .charIndex  = CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED,
                .value      = NULL
            };
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            cy_ble_esssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            Cy_BLE_ESS_ApplCallback((uint32_t)CY_BLE_EVT_ESSS_INDICATION_CONFIRMATION, &locCharValue);
        }
    }
}


#if (CY_BLE_GAP_ROLE_PERIPHERAL)

/******************************************************************************
* Function Name: Cy_BLE_ESSS_SetChangeIndex
***************************************************************************//**
*
*  Performs write operation of two-byte pseudo-random change index to the
*  advertisement packet. The "Service Data" field should be selected in the
*  component customizer GUI and contain a two-byte initial change index value
*  and in opposite case the function will always return
*  "CY_BLE_ERROR_INVALID_OPERATION".
*
*  This function must be called when Cy_BLE_GetBleSsState() returns
*  CY_BLE_BLESS_STATE_EVENT_CLOSE state.
*
*  \param essIndex: A two-byte pseudo-random change index to be written to the
*            advertisement data.
*
*  \param advertisingParamIndex: The index of the peripheral and broadcast
*                                 configuration in customizer. For example:
*   *CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX     0x00
*   *CY_BLE_BROADCASTER_CONFIGURATION_0_INDEX    0x01
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - On NULL pointer, Data length in input
*        parameter exceeds 31 bytes.
*  * CY_BLE_ERROR_INVALID_OPERATION - The change index is not present in the
*       advertisement data or its length is not equal to two bytes or ADV
*       Event is not closed, BLESS is active or ADV is not enabled.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_ESSS_SetChangeIndex(uint16_t essIndex,
                                                  uint8_t advertisingParamIndex)
{
    uint32_t fFlag = 0u;
    uint8_t adLength = 0u;
    uint32_t byteCounter = 0u;
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_OPERATION;

    if(advertisingParamIndex >= CY_BLE_GAPP_CONF_COUNT)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        while((byteCounter < cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advDataLen) &&
              (fFlag == 0u))
        {
            adLength = cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advData->advData[byteCounter];

