ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
    if((charIndex == CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED) &&
       (charInstance < cy_ble_essConfigPtr->esssCharInstances[charIndex]))
    {
        /* Send indication if it is enabled and connected */
        if(Cy_BLE_GetConnectionState(connHandle) < CY_BLE_CONN_STATE_CONNECTED)
        {
            apiResult = CY_BLE_ERROR_INVALID_STATE;
        }
        else if(!CY_BLE_IS_INDICATION_ENABLED(connHandle.attId,
                                              cy_ble_essConfigPtr->esss->charInfoAddr[charIndex].charInfoPtr[charInstance].
                                               descrHandle[CY_BLE_ESS_CCCD]))
        {
            apiResult = CY_BLE_ERROR_IND_DISABLED;
        }
        else
        {
            if(CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE !=
               cy_ble_essConfigPtr->esss->charInfoAddr[charIndex].charInfoPtr[charInstance].charHandle)
            {
                /* Fill all fields of write request structure ... */
                cy_stc_ble_gatts_handle_value_ind_t indReqParam =
                {
                    .handleValPair.attrHandle = cy_ble_essConfigPtr->esss->charInfoAddr[charIndex].
                                                 charInfoPtr[charInstance].charHandle,
                    .handleValPair.value.val  = attrValue,
                    .handleValPair.value.len  = attrSize,
                    .connHandle               = connHandle
                };
                /* Send indication to client using previously filled structure */
                apiResult = Cy_BLE_GATTS_Indication(&indReqParam);
                /* Save handle to support service-specific value confirmation response from client */
                if(apiResult == CY_BLE_SUCCESS)
                {
                    cy_ble_esssReqHandle = indReqParam.handleValPair.attrHandle;
                }
            }
            else
            {
                apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
            }
        }
    }

    return(apiResult);
}


#endif /* CY_BLE_ESS_SERVER */


#ifdef CY_BLE_ESS_CLIENT

/******************************************************************************
* Function Name: Cy_BLE_ESSC_DiscoverCharacteristicsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP
*  event. Based on the service UUID, an appropriate data structure is populated
*  using the data received as part of the callback.
*
*  \param discCharInfo: The pointer to a characteristic information structure.
*
******************************************************************************/
static void Cy_BLE_ESSC_DiscoverCharacteristicsEventHandler(const cy_stc_ble_disc_char_info_t *discCharInfo)
{
    /* ESS characteristics UUIDs */
    static const cy_ble_uuid16_t cy_ble_esscCharUuid[CY_BLE_ESS_CHAR_COUNT] =
    {
        CY_BLE_UUID_CHAR_DESCR_VALUE_CHANGED,
        CY_BLE_UUID_CHAR_APPARENT_WIND_DIRECTION,
        CY_BLE_UUID_CHAR_APPARENT_WIND_SPEED,
        CY_BLE_UUID_CHAR_DEW_POINT,
        CY_BLE_UUID_CHAR_ELEVATION,
        CY_BLE_UUID_CHAR_GUST_FACTOR,
        CY_BLE_UUID_CHAR_HEAT_INDEX,
        CY_BLE_UUID_CHAR_HUMIDITY,
        CY_BLE_UUID_CHAR_IRRADIANCE,
        CY_BLE_UUID_CHAR_POLLEN_CONCENTRATION,
        CY_BLE_UUID_CHAR_RAINFALL,
        CY_BLE_UUID_CHAR_PRESSURE,
        CY_BLE_UUID_CHAR_THEMPERATURE,
        CY_BLE_UUID_CHAR_TRUE_WIND_DIRECTION,
        CY_BLE_UUID_CHAR_TRUE_WIND_SPEED,
        CY_BLE_UUID_CHAR_UV_INDEX,
        CY_BLE_UUID_CHAR_WIND_CHILL,
        CY_BLE_UUID_CHAR_BAR_PRESSURE_TREND,
        CY_BLE_UUID_CHAR_MAGNETIC_DECLINATION,
        CY_BLE_UUID_CHAR_MAGNETIC_FLUX_DENSITY_2D,
        CY_BLE_UUID_CHAR_MAGNETIC_FLUX_DENSITY_3D
    };

    static cy_ble_gatt_db_attr_handle_t *lastEndHandle[CY_BLE_CONFIG_GATTC_COUNT] = { NULL };
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discCharInfo->connHandle);
    uint32_t i;
    uint32_t j;
    uint32_t exitLoop = 0u;

    if((discCharInfo->uuidFormat == CY_BLE_GATT_16_BIT_UUID_FORMAT) &&
       (cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_ESS))
    {
        /* Update last characteristic endHandle to declaration handle of this characteristic */
        if(lastEndHandle[discIdx] != NULL)
        {
            *lastEndHandle[discIdx] = discCharInfo->charDeclHandle - 1u;
            lastEndHandle[discIdx] = NULL;
        }

        /* Search through all available characteristics */
        for(i = (uint32_t)CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED; ((i < (uint32_t)CY_BLE_ESS_CHAR_COUNT) &&
                                                                (exitLoop == 0u)); i++)
        {
            for(j = 0u; j < cy_ble_essConfigPtr->esscCharInstances[i]; j++)
            {
                if(cy_ble_esscCharUuid[i] == discCharInfo->uuid.uuid16)
                {
                    if(cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[i].charInfoPtr != NULL)
                    {
                        if(cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[i].charInfoPtr[j].valueHandle ==
                           CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                        {
                            cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[i].charInfoPtr[j].valueHandle =
                                discCharInfo->valueHandle;
                            cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[i].charInfoPtr[j].properties =
                                discCharInfo->properties;
                            lastEndHandle[discIdx] =
                                &cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[i].charInfoPtr[j].endHandle;
                            exitLoop = 1u;
                            break;
                        }
                    }
                }
            }
        }

        /* Initialize characteristic endHandle to Service endHandle.
         * Characteristic endHandle will be updated to the declaration
         * handler of the following characteristic,
         * in the following characteristic discovery procedure. */
        if(lastEndHandle[discIdx] != NULL)
        {
            *lastEndHandle[discIdx] = cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.endHandle;
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


