ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
/******************************************************************************
* Function Name: Cy_BLE_ESSC_NotificationEventHandler
***************************************************************************//**
*
*  Handles a notification event for the Environmental Sensing Service.
*
*  \param eventParam: The pointer to the data structure specified by an event.
*
******************************************************************************/
static void Cy_BLE_ESSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint32_t j;
    uint32_t exitLoop = 0u;
    cy_en_ble_ess_char_index_t locCharIndex;

    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ESS_ApplCallback != NULL))
    {
        for(locCharIndex = (cy_en_ble_ess_char_index_t)0u; (locCharIndex < CY_BLE_ESS_CHAR_COUNT) &&
            (exitLoop == 0u); locCharIndex++)
        {
            if(cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr != NULL)
            {
                for(j = 0u; j < cy_ble_essConfigPtr->esscCharInstances[locCharIndex]; j++)
                {
                    if(cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].valueHandle ==
                       eventParam->handleValPair.attrHandle)
                    {
                        cy_stc_ble_ess_char_value_t notifValue =
                        {
                            .connHandle = eventParam->connHandle,
                            .charIndex  = locCharIndex,
                            .value      = &eventParam->handleValPair.value
                        };
                        Cy_BLE_ESS_ApplCallback((uint32_t)CY_BLE_EVT_ESSC_NOTIFICATION, &notifValue);
                        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                        exitLoop = 1u;
                        break;
                    }
                }
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ESSC_IndicationEventHandler
***************************************************************************//**
*
*  Handles an indication event for Environmental Sensing Service.
*
*  \param eventParam: The pointer to the data structure specified by an event.
*
******************************************************************************/
static void Cy_BLE_ESSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ESS_ApplCallback != NULL))
    {
        if(cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED].
            charInfoPtr[0u].valueHandle == eventParam->handleValPair.attrHandle)
        {
            cy_stc_ble_ess_char_value_t indicationValue =
            {
                .connHandle = eventParam->connHandle,
                .charIndex  = CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED,
                .value      = &eventParam->handleValPair.value,
            };
            Cy_BLE_ESS_ApplCallback((uint32_t)CY_BLE_EVT_ESSC_INDICATION, &indicationValue);
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ESSC_ReadLongRespEventHandler
***************************************************************************//**
*
*  Handles a Read Long Response event for the Environmental Sensing Service.
*
*  \param eventParam: The pointer to the data structure specified by an event.
*
******************************************************************************/
static void Cy_BLE_ESSC_ReadLongRespEventHandler(const cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t j;
    uint32_t i;
    uint32_t isReqEnded = 0u;
    cy_en_ble_ess_char_index_t locCharIndex;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ESS_ApplCallback != NULL))
    {
        /* Go trough all characteristics */
        for(locCharIndex = CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED; locCharIndex < CY_BLE_ESS_CHAR_COUNT; locCharIndex++)
        {
            /* Check if specific characteristic exist */
            if(cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr != NULL)
            {
                /* Go trough all characteristic instances */
                for(j = 0u; j < cy_ble_essConfigPtr->esscCharInstances[locCharIndex]; j++)
                {
                    /* Read Long Request is only supported for Characteristic User
                     * Description descriptor. Check if requested handle equals
                     * the descriptor.
                     */
                    if((cy_ble_esscReqHandle[discIdx] == cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].
                         charInfoPtr[j].descrHandle[CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR]) &&
                       (cy_ble_esscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
                    {
                        cy_stc_ble_gatt_xchg_mtu_param_t mtuParam = { .connHandle = eventParam->connHandle };

                        /* Update user buffer with received data */
                        for(i = 0u; (i < eventParam->value.len) && (cy_ble_esscCurrLen[discIdx] <
                                                                    cy_ble_esscRdLongBuffLen[discIdx]); i++)
                        {
                            cy_ble_esscRdLongBuffPtr[discIdx][cy_ble_esscCurrLen[discIdx]] = eventParam->value.val[i];
                            cy_ble_esscCurrLen[discIdx]++;
                        }
                        (void)Cy_BLE_GATT_GetMtuSize(&mtuParam);

                        /* If the received data length is less than the MTU size, the Read Long
                         * request is completed or the provided user's buffer is full.
                         */
                        if(((mtuParam.mtu - 1u) > eventParam->value.len))
                        {
                            cy_ble_esscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                        }
                        else if(cy_ble_esscCurrLen[discIdx] == cy_ble_esscRdLongBuffLen[discIdx])
                        {
                            cy_stc_ble_gattc_stop_cmd_param_t stopCmdParam = { .connHandle = eventParam->connHandle };
                            (void)Cy_BLE_GATTC_StopCmd(&stopCmdParam);
                        }
                        else
                        {
                            isReqEnded = 1u;
                        }

                        /* If the buffer is full, then stop any remaining read long requests */
                        if(isReqEnded == 0u)
                        {
                            cy_stc_ble_gatt_value_t rdValue =
                            {
                                .val = cy_ble_esscRdLongBuffPtr[discIdx],
                                .len = cy_ble_esscCurrLen[discIdx]
                            };
                            cy_stc_ble_ess_descr_value_t rdDescrValue =
                            {
                                .connHandle   = eventParam->connHandle,
                                .charIndex    = locCharIndex,
                                .charInstance = j,
                                .descrIndex   = CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR
                            };
                            rdDescrValue.value = &rdValue;
                            Cy_BLE_ESS_ApplCallback((uint32_t)CY_BLE_EVT_ESSC_READ_DESCR_RESPONSE, &rdDescrValue);
                        }

                        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                        break;
                    }
                }
            }
        }
    }
}


