ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ess.c
/******************************************************************************
* Function Name: Cy_BLE_ESSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles a Read Response event for the Environmental Sensing Service.
*
*  \param eventParam: The pointer to the data structure specified by an event.
*
******************************************************************************/
static void Cy_BLE_ESSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t j;
    uint32_t locReqHandle = 0u;
    cy_en_ble_ess_char_index_t locCharIndex;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ESS_ApplCallback != NULL) &&
       (cy_ble_esscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        for(locCharIndex = CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED; (locCharIndex < CY_BLE_ESS_CHAR_COUNT) &&
            (locReqHandle == 0u); locCharIndex++)
        {
            if(cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr != NULL)
            {
                for(j = 0u; ((j < cy_ble_essConfigPtr->esscCharInstances[locCharIndex]) && (locReqHandle == 0u)); j++)
                {
                    if(cy_ble_esscReqHandle[discIdx] ==
                       cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].valueHandle)
                    {
                        cy_stc_ble_ess_char_value_t locCharValue =
                        {
                            .connHandle   = eventParam->connHandle,
                            .charIndex    = locCharIndex,
                            .charInstance = j,
                            .value        = &eventParam->value
                        };
                        cy_ble_esscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                        Cy_BLE_ESS_ApplCallback((uint32_t)CY_BLE_EVT_ESSC_READ_CHAR_RESPONSE, &locCharValue);
                        locReqHandle = 1u;
                    }
                    else
                    {
                        cy_en_ble_ess_descr_index_t locDescIndex;

                        for(locDescIndex = CY_BLE_ESS_CCCD; (locDescIndex < CY_BLE_ESS_DESCR_COUNT) &&
                            (locReqHandle == 0u); locDescIndex++)
                        {
                            if(cy_ble_esscReqHandle[discIdx] ==
                               cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                descrHandle[locDescIndex])
                            {
                                cy_stc_ble_ess_descr_value_t locDescrValue =
                                {
                                    .connHandle   = eventParam->connHandle,
                                    .charIndex    = locCharIndex,
                                    .descrIndex   = locDescIndex,
                                    .charInstance = j,
                                    .value        = &eventParam->value
                                };
                                cy_ble_esscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                                Cy_BLE_ESS_ApplCallback((uint32_t)CY_BLE_EVT_ESSC_READ_DESCR_RESPONSE, &locDescrValue);
                                locReqHandle = 1u;
                            }
                        }
                    }
                }
            }
        }
        if(locReqHandle != 0u)
        {
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ESSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles a Write Response event for the Environmental Sensing Service.
*
*  \param eventParam: The pointer to a data structure specified by an event.
*
******************************************************************************/
static void Cy_BLE_ESSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint8_t j;
    uint32_t locReqHandle = 0u;
    cy_en_ble_ess_char_index_t locCharIndex;
    cy_stc_ble_ess_descr_value_t locDescrValue = { .connHandle = *eventParam };

    /* Check if service handler was registered and request handle is
     * valid.
     */
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ESS_ApplCallback != NULL) &&
       (cy_ble_esscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        for(locCharIndex = CY_BLE_ESS_DESCRIPTOR_VALUE_CHANGED; (locCharIndex < CY_BLE_ESS_CHAR_COUNT) &&
            (locReqHandle == 0u); locCharIndex++)
        {
            /* If this condition is false, this means that the current characteristic
             * is not included in the GUI, in other words support for the characteristic is
             * not enabled.
             */
            if(cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr != NULL)
            {
                for(j = 0u; ((j < cy_ble_essConfigPtr->esscCharInstances[locCharIndex]) && (locReqHandle == 0u)); j++)
                {
                    /* Check if requested descriptor handle is in
                     * characteristic range.
                     */
                    if((cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].valueHandle <
                        cy_ble_esscReqHandle[discIdx]) &&
                       (cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].endHandle >=
                        cy_ble_esscReqHandle[discIdx]))
                    {
                        if(cy_ble_esscReqHandle[discIdx] ==
                           cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                            descrHandle[CY_BLE_ESS_CCCD])
                        {
                            locDescrValue.descrIndex = CY_BLE_ESS_CCCD;
                        }
                        else
                            if(cy_ble_esscReqHandle[discIdx] ==
                               cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                descrHandle[CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR1])
                            {
                                locDescrValue.descrIndex = CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR1;
                            }
                            else
                                if(cy_ble_esscReqHandle[discIdx] ==
                                   cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                    descrHandle[CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR2])
                                {
                                    locDescrValue.descrIndex = CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR2;
                                }
                                else if(cy_ble_esscReqHandle[discIdx] ==
                                        cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                         descrHandle[CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR3])
                                {
                                    locDescrValue.descrIndex = CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR3;
                                }
                                else if(cy_ble_esscReqHandle[discIdx] ==
                                        cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                         descrHandle[CY_BLE_ESS_ES_CONFIG_DESCR])
                                {
                                    locDescrValue.descrIndex = CY_BLE_ESS_ES_CONFIG_DESCR;
                                }
                                else if(cy_ble_esscReqHandle[discIdx] ==
                                        cy_ble_essConfigPtr->essc[discIdx].charInfoAddr[locCharIndex].charInfoPtr[j].
                                         descrHandle[CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR])
                                {
                                    locDescrValue.descrIndex = CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR;
                                }
                                else
                                {
                                    /* Should never enter here */
                                }

                        locDescrValue.charIndex = locCharIndex;
                        locDescrValue.charInstance = j;
                        locDescrValue.value = NULL;
                        cy_ble_esscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                        Cy_BLE_ESS_ApplCallback((uint32_t)CY_BLE_EVT_ESSC_WRITE_DESCR_RESPONSE, &locDescrValue);
                        locReqHandle = 1u;
                    }
                }
            }
        }

